# Taps
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'thoughtbot/formulae'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'heroku/brew'
tap 'jmhobbs/parrot'

# Settings
cask_args appdir: '/Applications'

# Libs
brew 'openssl'
brew 'coreutils'
brew 'md5sha1sum'
brew 'ctags'
brew 'libxml2'
brew 'libpng'
brew 'freetype'
brew 'ffmpeg'
brew 'readline'
brew 'doxygen'

# UNIX Tools
brew 'git'
brew 'ack'
brew 'vim'
brew 'httpie'
brew 'curl'
brew 'p7zip'
brew 'grep'
brew 'tree'

# Heroku & GitHub
brew 'heroku/brew/heroku'
brew 'hub'

# Image manipulation
brew 'imagemagick'

# Programming languages
brew 'libyaml' # should come after openssl
brew 'nvm'
brew 'ruby-build'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'yarn', args: ['without-node']

# Databases
brew 'postgres', restart_service: true
brew 'redis', restart_service: true
brew 'sqlite'

# Parrots
brew 'terminal-parrot'

# Cask QL Plugins
cask 'qlmarkdown'
cask 'quicklook-json'

# Cask Fonts
cask 'font-inconsolata'

# Antivirus
cask 'avira-antivirus'

# Text Editors
cask 'atom'
cask 'visual-studio-code'

# Browsers
cask 'firefox'
cask 'google-chrome'

# Other GUI Apps
cask 'postman'
cask 'slack'
cask 'github'
cask 'virtualbox'
cask 'vagrant'
cask 'macdown'
cask 'iterm2'
